In [2]:
import pandas as pd

In [4]:
list('123')

['1', '2', '3']

In [6]:
dados =[[3,5,1],[7,3,8],[8,2,6]]

In [8]:
df = pd.DataFrame(dados, list('231'),list('ZYX'))

In [9]:
df

   Z  Y  X
2  3  5  1
3  7  3  8
1  8  2  6

In [10]:
df.sort_index(inplace=True)

In [11]:
df

   Z  Y  X
1  8  2  6
2  3  5  1
3  7  3  8

In [12]:
df.sort_index(inplace=True,axis=1)

In [13]:
df

   X  Y  Z
1  6  2  8
2  1  5  3
3  8  3  7

In [14]:
df.sort_values(by = 'Y', inplace=True)

In [15]:
df

   X  Y  Z
1  6  2  8
3  8  3  7
2  1  5  3

In [16]:
df.sort_values(by = ['X','Y','Z'], inplace=True)
df

   X  Y  Z
2  1  5  3
1  6  2  8
3  8  3  7